Revit 2027 API
ViewSchedule.GetDefaultNameForRevisionSchedule Method
 Gets the default view name that will be used when creating a revision schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetDefaultNameForRevisionSchedule(
	Document document
)
Public Shared Function GetDefaultNameForRevisionSchedule (
	document As Document
) As String
public:
static String^ GetDefaultNameForRevisionSchedule(
	Document^ document
)
static member GetDefaultNameForRevisionSchedule :
        document : Document -> string
Parameters
document Document
 The titleblock family document to which the new schedule will be added.
Return Value
String
 The default view name.
Exceptions
Exception | Condition
ArgumentException |  document is not a titleblock family.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace